리스트 = ['intra.h', 'intra.c', 'define.h', 'run.py']



for i in 리스트:
    if (i.split(".")[1] == "h") or (i.split(".")[1] == "c"):
        print(i)


        "매출 증가", "차별화 포인트 부족", "고객 이탈 가속화", "브랜드 파워 저하",
        "수익성 낮은 포트폴리오 의존", "조직 생산성 정체", "운영비 증가", "핵심 인재 이탈",
        "디지털 역량 부족", "비즈니스 모델의 한계 도달", "신규 사업의 불확실성", "기술 변화에 대한 대응력 부족",
        "규제 변화 리스크", "수익성 개선 요구", "파트너,공급망 불안정", "투자여력 부족",
        "조직 사기 저하", "변화 관리 부담", "단기 생존 vs 장기 투자 갈등", "미래 사업 전략 부재"



        "지속적인 매출 증대", "Key Account 관계 강화", "고객 이탈 방지", "대외 인지도 향상",
        "인건비 중심 사업 의존 탈피", "인당 조직 생산성 향상", "비용 통제 강화", "핵심 인재 이탈 방지",
        "'FM+디지털' 융합서비스 발굴", "사업 다각화의 속도 조절", "변화에 저항하는 조직 내성 타파",
        "사업 구조별 책임경영 도입",
        "규제 리스크 대응", "주주의 수익 기대치 부응", "차별화된 품질/원가 경쟁력 확보", "중장기 사업 전략 수립"


        "지속적인 매출 증대", "차별화 포인트 강화", "고객 이탈 방지", "대외 인지도 향상",
        "수익성 낮은 포트폴리오 탈피", "인당 조직 생산성 향상", "운영비 통제", "핵심 인재 이탈 방지",
        "고객 체감 DX 강화", "비즈니스 모델의 한계 돌파", "신규 사업의 수익성 확보", "기술 변화 대응력 강화",
        "규제 리스크 대응", "수익성 개선", "전략적 공급망 확대", "서비스 투자 확대",
        "조직 사기 향상", "변화 관리 강화", "단기 성과 전략 수립", "중장기 사업 전략 수립"


